Revit 2026 API

# TableCellCombinedParameterDataParamId Property

---

The parameter id

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ParamId { get; set; }
```
```vb
Public Property ParamId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ ParamId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member ParamId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

TableCellCombinedParameterData Class

Autodesk.Revit.DB Namespace